[
	{
		"id": "YUVcPsqKROynBjCANjWGm",
		"name": "README",
		"createdAt": "April 5, 2022",
		"content": "# Frontend Mentor - In-browser markdown editor solution\n\nThis is a solution to the [In-browser markdown editor challenge on Frontend Mentor](https://www.frontendmentor.io/challenges/inbrowser-markdown-editor-r16TrrQX9). Frontend Mentor challenges help you improve your coding skills by building realistic projects. \n\n## Table of contents\n\n- [Overview](#overview)\n  - [The challenge](#the-challenge)\n  - [Screenshot](#screenshot)\n  - [Links](#links)\n- [My process](#my-process)\n  - [Built with](#built-with)\n  - [What I learned](#what-i-learned)\n  - [Continued development](#continued-development)\n  - [Useful resources](#useful-resources)\n- [Author](#author)\n- [Acknowledgments](#acknowledgments)\n\n**Note: Delete this note and update the table of contents based on what sections you keep.**\n\n## Overview\n\n### The challenge\n\nUsers should be able to:\n\n- Create, Read, Update, and Delete markdown documents\n- Name and save documents to be accessed as needed\n- Edit the markdown of a document and see the formatted preview of the content\n- View a full-page preview of the formatted content\n- View the optimal layout for the app depending on their device's screen size\n- See hover states for all interactive elements on the page\n- **Bonus**: If you're building a purely front-end project, use localStorage to save the current state in the browser that persists when the browser is refreshed\n- **Bonus**: Build this project as a full-stack application\n\n### Screenshot\n\n![screenshot](https://github.com/remyboire/markdowneditor/screenshot.jpg?raw=true)\n\nAdd a screenshot of your solution. The easiest way to do this is to use Firefox to view your project, right-click the page and select \"Take a Screenshot\". You can choose either a full-height screenshot or a cropped one based on how long the page is. If it's very long, it might be best to crop it.\n\nAlternatively, you can use a tool like [FireShot](https://getfireshot.com/) to take the screenshot. FireShot has a free option, so you don't need to purchase it. \n\nThen crop/optimize/edit your image however you like, add it to your project, and update the file path in the image above.\n\n**Note: Delete this note and the paragraphs above when you add your screenshot. If you prefer not to add a screenshot, feel free to remove this entire section.**\n\n### Links\n\n- Solution URL: [Github](https://github.com/remyboire/markdowneditor)\n- Live Site URL: [Github Page](https://remyboire.github.io/markdowneditor/)\n\n## My process\n\n### Built with\n\n- Semantic HTML5 markup\n- CSS custom properties\n- Flexbox\n- CSS Grid\n- Mobile-first workflow\n- [React](https://reactjs.org/) - JS library\n- [Next.js](https://nextjs.org/) - React framework\n- [Styled Components](https://styled-components.com/) - For styles\n\n**Note: These are just examples. Delete this note and replace the list above with your own choices**\n\n### What I learned\n\nUse this section to recap over some of your major learnings while working through this project. Writing these out and providing code samples of areas you want to highlight is a great way to reinforce your own knowledge.\n\nTo see how you can add code snippets, see below:\n\n```html\n<h1>Some HTML code I'm proud of</h1>\n```\n```css\n.proud-of-this-css {\n  color: papayawhip;\n}\n```\n```js\nconst proudOfThisFunc = () => {\n  console.log('🎉')\n}\n```\n\nIf you want more help with writing markdown, we'd recommend checking out [The Markdown Guide](https://www.markdownguide.org/) to learn more.\n\n**Note: Delete this note and the content within this section and replace with your own learnings.**\n\n### Continued development\n\nUse this section to outline areas that you want to continue focusing on in future projects. These could be concepts you're still not completely comfortable with or techniques you found useful that you want to refine and perfect.\n\n**Note: Delete this note and the content within this section and replace with your own plans for continued development.**\n\n### Useful resources\n\n- [Example resource 1](https://www.example.com) - This helped me for XYZ reason. I really liked this pattern and will use it going forward.\n- [Example resource 2](https://www.example.com) - This is an amazing article which helped me finally understand XYZ. I'd recommend it to anyone still learning this concept.\n\n**Note: Delete this note and replace the list above with resources that helped you during the challenge. These could come in handy for anyone viewing your solution or for yourself when you look back on this project in the future.**\n\n## Author\n\n- Website - [Add your name here](https://www.your-site.com)\n- Frontend Mentor - [@yourusername](https://www.frontendmentor.io/profile/yourusername)\n- Twitter - [@yourusername](https://www.twitter.com/yourusername)\n\n**Note: Delete this note and add/remove/edit lines above based on what links you'd like to share.**\n\n## Acknowledgments\n\nThis is where you can give a hat tip to anyone who helped you out on this project. Perhaps you worked in a team or got some inspiration from someone else's solution. This is the perfect place to give them some credit.\n\n**Note: Delete this note and edit this section's content as necessary. If you completed this challenge by yourself, feel free to delete this section entirely.**\n"
	},
	{
		"id": "YUVcPsqKROynBadCANjWGm",
		"name": "welcome",
		"createdAt": "April 5, 2022",
		"content": "# Welcome to Markdown\n\nMarkdown is a lightweight markup language that you can use to add formatting elements to plaintext text documents.\n\n## How to use this?\n\n1. Write markdown in the markdown editor window\n2. See the rendered markdown in the preview window\n\n### Features\n\n- Create headings, paragraphs, links, blockquotes, inline-code, code blocks, and lists\n- Name and save the document to access again later\n- Choose between Light or Dark mode depending on your preference\n\n> This is an example of a blockquote. If you would like to learn more about markdown syntax, you can visit this [markdown cheatsheet](https://www.markdownguide.org/cheat-sheet/).\n\n#### Headings\n\nTo create a heading, add the hash sign (#) before the heading. The number of number signs you use should correspond to the heading level. You'll see in this guide that we've used all six heading levels (not necessarily in the correct way you should use headings!) to illustrate how they should look.\n\n##### Lists\n\nYou can see examples of ordered and unordered lists above.\n\n###### Code Blocks\n\nThis markdown editor allows for inline-code snippets, like this: `<p>I'm inline</p>`. It also allows for larger code blocks like this:\n\n```\n<main>\n  <h1>This is a larger code block</h1>\n</main>\n```"
	}
]
